<!DOCTYPE html>

<html lang="ru">

<head>

    <meta charset="UTF-8">

    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">

    <meta http-equiv="X-UA-Compatible" content="ie=edge">

    <link rel="stylesheet" href="General.css">
    <title>Practice</title>
  <style>
       body {
    background-color: #b0d9c4; /* Цвет фона */
   }
  </style>

</head>
<body>
    <!-- Side navigation -->
<div class="sidenav">
    <a href="python.html">О Python</a>
    <a href="sintaksis.html">Синтаксис</a>
    <a href="practice.html" class = 'active'>Практика по написанию простых программ</a>
    <a href="cycles.html">Циклы "for" и "while"</a>
    <a href="Oge.html">Задачи из ОГЭ по информатике</a>
    <a href="Otpravka.html">Обратная связь</a>
    <a href="ID.html">Разворот паспорта</a>
    <a href="DOM.html">Dom</a>
    <a href="Task.html">Задача JS</a>
    <a href="Index.html">На главную</a>
  </div>
  <div class="main">
    <H2>Практика по написанию простых программ.</h2>
    <H3>Задача 1.</h3>
      <p>Напишите программу вывода на экран трех последовательно идущих чисел, каждое на отдельной строке. Первое число вводит пользователь, остальные числа вычисляются в программе.</p>
      <p>Формат входных данных: на вход программе подается одно целое число.</p>
      <p>Формат выходных данных: Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.</p>
    <H3>Задача 2.</h3>
      <p>Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.</p>
      <p>Формат входных данных: на вход программе подается одно целое число - длина ребра.</p>
      <p>Формат выходных данных: программа должна вывести текст и числа в соответствии с условием задачи.</p>
      <p>Примечание: объём куба и площадь полной поверхности можно вычислить по формулам V = a^3, S = 6*a^2</p> 
    <H3>Задача 3.</h3>
      <p>Напишите программу для пересчёта величины временного интервала, заданного в минутах, в величину, выраженную в часах и минутах.</p>
      <p>Формат входных данных: на вход программе подаётся целое число – количество минут.</p>
      <p>Формат выходных данных: программа должна вывести текст в соответствии с условием задачи.</p>
      <h3>Задача 4.</h3>
        <p>Напишите программу, которая принимает три положительных числа и определяет, существует ли невырожденный треугольник с такими сторонами.</p>
        <p>Формат входных данных: на вход программе подаётся три положительных целых числа.</p>
        <p>Формат выходных данных: gрограмма должна вывести «YES» или «NO» в соответствии с условием задачи.</p>
        <p>Примечание: треугольник существует, если выполняется условие неравенаства треугольника.</p>
      <h3>Задача 5.</h3>
        <p>На вход программе подается натуральное число nn. Напишите программу, которая для каждого из чисел от 00 до nn (включительно) выводит фразу: «Квадрат числа [число] равен [число]» (без кавычек).</p>
        <p>Формат входных данных: на вход программе подается натуральное число nn.</p>
        <p>Формат выходных данных: программа должна вывести текст в соответствии с условием задачи.</p>
      <h3>Задача 6.</h3>
        <p>На вход программе подается последовательность целых чисел, каждое число на отдельной строке. Концом последовательности является любое отрицательное число. Напишите программу, которая выводит сумму всех членов данной последовательности.</p>
        <p>Формат входных данных: на вход программе подается последовательность чисел, каждое число на отдельной строке.</p>
        <p>Формат выходных данных: программа должна вывести сумму членов данной последовательности.</p>
      <style>
        .del { display: none; }
        .del:not(:checked) + label + * { display: none; }
        /* тут редактируем вид кнопки */
        .del:not(:checked) + label,
        .del:checked + label {
        display: inline-block;
        padding: 2px 10px;
        border-radius: 2px;
        color: #fff;
        background: #4e6473;
        cursor: pointer;
        }
        .del:checked + label {
        background: #e36443;
        }
        </style>
        <input type="checkbox" id="raz" class="del"/>
        <label for="raz" class="del">Показать решение задач</label><div>
       <strong><table border="1">
       <p>Решение задачи 1:</p>
       <table border="2">
        <tr>
          <td><p>a = int(input())</p>
            <p>print(a)</p>
            <p>print(a+1)</p>
            <p>print(a+2)</p>
          </td>
        </tr>
       </table> 
       <p>Решение задачи 2:</p>
       <table border="3">
       <tr>
        <td><p>a = int(input())</p>
          <p>V = a*a*a</p>
          <p>print("Объём =", V)</p>
          <p>S = 6*(a*a)</p>
          <p>print("Площадь полной поверхности =", S)</p>
        </td>
       </tr>
       </table>
       <p>Решение задачи 3:</p>
       <table border="3">
       <tr>
        <td><p>a = int(input())></p>
          <p>b = a // 60</p>
          <p>c = a % 60</p>
          <p>print(a, "мин - это", b, "час", c, "минут.")/p>
        </td>
       </tr>
       </table>
       <p>Решение задачи 4:</p>
       <table border="4">
       <tr>
        <td><p>a = int(input())</p>
          <p>b = int(input())</p>
          <p>c = int(input())</p>
          <p>if a + b > c and b + c > a and a + c > b:</p>
          <p align="center">print("YES")</p>
          <p>else:</p>
          <p align="center">print("NO")</p>
        </td>
       </tr>
       </table>
       <p>Решение задачи 5:</p>
       <table border="5">
        <tr>
          <td><p>n = int(input())</p>
            <p>for n in range(n+1):</p>
            <p align="center">print("Квадрат числа",n, "равен", (n**2))</p>
          </td>
        </tr>
       </table>
       <p>Решение задачи 6:</p>
       <table border="6">
        <tr>
          <td><p>n = int(input())/p>
            <p>sum = 0</p>
            <p>while n >= 0:</p>
            <p align="center">sum = sum + n</p>
            <p align="center">n = int(input())</p>
            <p>print(sum)</p>
          </td>
        </tr>
       </table>    
      </strong> </div></div>